tap "homebrew/bundle"                           # Homebrew bundle plugin
brew "cmake"                                     # Build system generator
brew "coreutils"                                 # GNU core utilities (ls, cat, etc.)
brew "fd"                                        # Fast alternative to find
brew "ffmpeg"                                    # Video/audio processing toolkit
brew "fzf"                                       # Fuzzy finder for terminal
brew "gh"                                        # GitHub CLI
brew "gnu-sed"                                   # GNU version of sed
brew "gnu-tar"                                   # GNU version of tar
brew "go"                                        # Go programming language
brew "kubernetes-cli"                            # Kubernetes CLI (kubectl)
brew "lazygit"                                   # Git UI for terminal
brew "make"                                      # Build automation tool
brew "mas"                                       # Mac App Store CLI
brew "minikube"                                  # Local Kubernetes cluster
brew "neovim"                                    # Text editor
brew "openjdk@11"                                # Java 11
brew "openjdk@17"                                # Java 17
brew "openjdk@21"                                # Java 21
brew "pipx"                                      # Python app installer
brew "ripgrep"                                   # Fast grep replacement
brew "ruby-install"                              # Ruby version installer
brew "smartmontools"                             # Hard drive monitoring
brew "syncthing"                                 # File synchronization
brew "tmux"                                      # Terminal multiplexer
brew "trash", link: true                        # Move files to trash
brew "uv"                                        # Python package manager
brew "wget"                                      # File downloader
brew "yt-dlp"                                    # YouTube downloader
cask "aldente"                                   # Battery charge limiter
cask "appcleaner"                                # App uninstaller
cask "blackhole-2ch"                             # Audio loopback driver
cask "bruno"                                     # API testing tool
cask "foobar2000"                                # Audio player
cask "github"                                    # GitHub Desktop
cask "google-chrome"                             # Web browser
cask "iina"                                      # Video player
cask "kitty"                                     # Terminal emulator
cask "legcord"                                   # Discord client
cask "maccy"                                     # Clipboard manager
cask "notunes"                                   # Disable iTunes opening
cask "orbstack"                                  # Docker/Linux VM alternative
cask "oversight"                                 # Camera/microphone monitor
cask "qbittorrent"                               # BitTorrent client
cask "raycast"                                   # Spotlight replacement
cask "slack"                                     # Team communication
cask "stremio"                                   # Media streaming
cask "tg-pro"                                    # Temperature/fan monitor
cask "tor-browser"                               # Privacy browser
cask "whatsapp"                                  # Messaging app
cask "wireshark-app"                             # Network analyzer
cask "zulu@8"                                    # Java 8 JDK
mas "Telegram Lite", id: 946399090             # Messaging app
mas "Xcode", id: 497799835                      # iOS/macOS development
vscode "anthropic.claude-code"                  # Claude AI assistant
vscode "bradlc.vscode-tailwindcss"              # TailwindCSS support
vscode "csstools.postcss"                       # PostCSS support
vscode "dbaeumer.vscode-eslint"                 # ESLint integration
vscode "esbenp.prettier-vscode"                 # Code formatter
vscode "github.copilot"                         # GitHub Copilot AI
vscode "github.copilot-chat"                    # Copilot chat interface
vscode "github.vscode-github-actions"           # GitHub Actions support
vscode "golang.go"                              # Go language support
vscode "jock.svg"                               # SVG viewer
vscode "ms-python.black-formatter"              # Python Black formatter
vscode "ms-python.debugpy"                      # Python debugger
vscode "ms-python.python"                       # Python language support
vscode "ms-python.vscode-pylance"               # Python language server
vscode "ms-python.vscode-python-envs"           # Python environment manager
vscode "ms-toolsai.jupyter"                     # Jupyter notebook support
vscode "ms-toolsai.jupyter-keymap"              # Jupyter keybindings
vscode "ms-toolsai.jupyter-renderers"           # Jupyter renderers
vscode "ms-toolsai.vscode-jupyter-cell-tags"    # Jupyter cell tags
vscode "ms-toolsai.vscode-jupyter-slideshow"    # Jupyter slideshow
vscode "svelte.svelte-vscode"                   # Svelte framework support
vscode "tomoki1207.pdf"                         # PDF viewer
vscode "vscode-icons-team.vscode-icons"         # File icons
vscode "wayou.vscode-todo-highlight"            # TODO highlighting
vscode "zhuangtongfa.material-theme"            # Material theme