tap "homebrew/bundle"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "asitop"
brew "automake"
brew "awscli"
brew "bison"
brew "chruby"
brew "cmake"
brew "php"
brew "composer"
brew "deno"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gdbm"
brew "gh"
brew "gnu-sed"
brew "go"
brew "htop"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "lazygit"
brew "libffi"
brew "libyaml"
brew "luarocks"
brew "make"
brew "mas"
brew "minikube"
brew "neovim"
brew "openjdk@11"
brew "openjdk@17"
brew "ripgrep"
brew "ruby-install"
brew "rustup-init"
brew "smartmontools"
brew "svg2png"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tokei"
brew "trash"
brew "wget"
brew "yt-dlp"
brew "zig"
cask "1password"
cask "aldente"
cask "android-file-transfer"
cask "appcleaner"
cask "betterdisplay"
cask "blackhole-2ch"
cask "brave-browser"
cask "dbeaver-community"
cask "diffusionbee"
cask "docker"
cask "firefox"
cask "flutter"
cask "flux"
cask "free-download-manager"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iina"
cask "iterm2"
cask "julia"
cask "maccy"
cask "middleclick"
cask "miniforge"
cask "mongodb-compass"
cask "ngrok"
cask "notion"
cask "notunes"
cask "oversight"
cask "postman"
cask "rectangle"
cask "slack"
cask "spotify"
cask "steam"
cask "tg-pro"
cask "utm"
cask "visual-studio-code"
cask "whatsapp"
cask "whisky"
mas "AdBlock", id: 1402042596
mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Telegram Lite", id: 946399090
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "antfu.unocss"
vscode "ardenivanov.svelte-intellisense"
vscode "bbenoist.nix"
vscode "bmalehorn.shell-syntax"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "irongeek.vscode-env"
vscode "jock.svg"
vscode "mads-hartmann.bash-ide-vscode"
vscode "malmaud.tmux"
vscode "million.million-lint"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "tauri-apps.tauri-vscode"
vscode "tomoki1207.pdf"
vscode "vadimcn.vscode-lldb"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "yinfei.luahelper"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
