tap "homebrew/bundle"
brew "sqlite"
brew "awscli"
brew "libyaml"
brew "cocoapods"
brew "deno"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "go"
brew "htop"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "lazygit"
brew "make"
brew "minikube"
brew "neovim"
brew "openjdk@11"
brew "openjdk@17"
brew "rustup-init"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "trash"
brew "wget"
brew "yt-dlp"
cask "1password"
cask "aldente"
cask "appcleaner"
cask "blackhole-2ch"
cask "brave-browser"
cask "dbeaver-community"
cask "docker"
cask "firefox"
cask "flutter"
cask "free-download-manager"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iina"
cask "iterm2"
cask "miniforge"
cask "mongodb-compass"
cask "ngrok"
cask "notion"
cask "postman"
cask "raycast"
cask "rectangle"
cask "slack"
cask "spotify"
cask "steam"
cask "tg-pro"
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "antfu.unocss"
vscode "ardenivanov.svelte-intellisense"
vscode "bbenoist.nix"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "irongeek.vscode-env"
vscode "jock.svg"
vscode "mads-hartmann.bash-ide-vscode"
vscode "malmaud.tmux"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "tomoki1207.pdf"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "yinfei.luahelper"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
